11/data/attachments/5ca04f74b2409b2b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Rebecca_spend_Friend_10306_1</nif:username>
            <nif:friendToBeRequested>soap_friends_e3f83404-b8da-44ed-897b-8a24167d119f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>